["Select your Gender", "Select your age range", "Select your geographical zone", "Select your present Academic Status", "Select all your past and present Education Level/Certificates (You can choose more than one)", "Please select all social Media Platforms for which you have a personal profile or account (You can choose more than one)", "Select all the emerging technologies that you have used or participated in for academic purposes (You can choose more than one)", "How do you access your social media platforms? (You can choose more than one)", "How long have you been using social networking sites?", "How often do you visit your Social Network accounts?", "How many of your classmates are your contacts/friends on your social networking sites?", "Why do you use social networks? (You can choose more than one)", "Incorporating social media platforms and emerging technologies highlighted earlier will enhance my productivity as a Student", "Social media platforms and emerging technologies highlighted earlier could help facilitate learning and engage students at educational institutions?", "Incorporating social media and emerging technologies as a teaching tool will increase my comprehension and assimilation as a student", "Educational Learning via the social media platforms will be easy for me", "Educational Learning via emerging technologies highlighted earlier will be easy for me", " It will be beneficial for me to become skilful at using social media platforms and emerging technologies for learning", " My colleagues think I should use social media and emerging technologies for learning", "My family and friends will appreciate my use of social media and emerging technologies for learning", "My privacy will be infringed if social media platforms and emerging technologies are proposed for teaching and learning", "Internet availability and signal strength will be a problem in using the social media and emerging technologies for learning  ", "Internet data bundles affordability will be a problem in using the social media and emerging technologies for learning  ", "Power availability will be a problem in using the social media and emerging technologies for learning  ", "I have the technical skills to use social media platforms and emerging technologies for learning", "I will be willing to use social media platforms and emerging technologies for learning.", "Which elearning courses or platforms are you currently engaged in.", "perceived_usefulness_score", "perceived_ease_score", "willingness_score"]